# ResetCellOverride Method (Int32) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..ResetCellOverride Method (Int32)
TableSectionData Class See Also
---
Resets the override of the column.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void ResetCellOverride(
	int nCol
)
```

Visual Basic
---
```text
Public Sub ResetCellOverride ( _
	nCol As Integer _
)
```

Visual C++
---
```text
public:
void ResetCellOverride(
	int nCol
)
```

# ### Parameters
nCol
    Type: System..::..Int32
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The given column number nCol is invalid. |

# See Also
TableSectionData Class
ResetCellOverride Overload
Autodesk.Revit.DB Namespace